app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    puts "Regardee"
    @gossip = Gossip.new
    @gossip.title = (params["title"])
    @gossip.content = (params["content"])
    @gossip.user = current_user


    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "j'espère que tu marches pour que je puisse aller me coucher tu"], ["updated_at", "2019-10-31 20:24:50.680941"], ["id", 24]]
---
  def update
    @gossip = Gossip.find(params[:id])
    gossip_params = params.require(:gossip).permit(:title, :content)
    if @gossip.update(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def right_user
    @gossip=Gossip.find(params[:id])
    @user=User.find(@gossip.user_id)